{
    "dh_cartune": "1.0.0",
    "dh_cardance": "1.0.0",
    "dh_lib": "1.0.3",
    "devhub_lib": "1.0.3",
    "dh_skillTree": {
        "version": "2.0.0",
        "changelog": [
            "Added ability to connect images in place of skill icons.",
            "Added tooltips added to the Skill Tree generator to clarify the purpose of each parameter.",
            "Added new option to hide category visibility for specific users: Config.CategoryVisibilityHandler.",
            "Added functionality to remove XP within the current level range without reducing the level.",
            "Added server-side exports: removePoints and removeXp.",
            "Added uI configuration to adjust sound volume and customize number formatting.",
            "Added text formatting for XP numbers in the UI.",
            "Added missing translations in the Skill Tree generator.",
            "Added client-side export: closeSkillTree.",
            "Added server-side export: getUnlockedSkills.",
            "Added client-side export: getConfig.",
            "Added new options in the generator for skill tree customization.",
            "Added system to block unlocking of certain skills if another skill is unlocked.",
            "Added additional animations in the UI, such as confetti upon unlocking a skill.",
            "Added highlight color changed to the primary theme color.",
            "Added summary of missed errors added during the save attempt in the generator.",
            "Fixed cached keybind issue for opening the menu via keybind.",
            "Fixed skill category selection centering in the top panel.",
            "Fixed incorrectly displayed warning about duplicate UID in the generator when replacing a previously assigned UID.",
            "Fixed issue where opening a new skill info window replaced information in an already open window.",
            "Resolved an issue that was causing the Herbal Skill Tree to fail loading occasionally",
            "Fixed sound not working in certain cases.",
            "Improved rendering performance of various Skill Tree UI components.",
            "Improved validation of already-used categories in the generator.",
            "Improved validation of used UIDs, points, and skill effects.",
            "Improved highlighting of skills with errors or missing required data in the generator.",
            "Renamed parameters in exports and listeners for better intuitiveness.",
            "Expanded README and documentation with numerous examples for using exports and listeners.",
            "Updated resource name, exports, and listeners to align with new scripts for consistency.",
            "",
            "[Old export and listener names will continue to work, so no changes are required in existing code. Script name changes in the CFG are also unnecessary.]",
            "[All files should be replaced except configs/sh.skills.lua and configs/sh.main.lua. The remaining config files can be easily compared, and only the additions should be transferred. The updates are marked as 'update 2.0.0'.]"
        ]
    },
    "devhub_skillTree": {
        "version": "2.0.1",
        "changelog": [
            "New client listener devhub_skillTree:client:listener:levelUp added.",
            "Config.DisableXpEarnWhileDead option added to block XP earning while dead, requires dh_lib:client:setDeathStatus configuration.",
            "Config.UnlockHandlerForSkills option added for custom skill unlock requirements (e.g., requiring items).",
            "Error sound added for skill unlock failures.",
            "Webhook integration option added for suspected player activity logging.",
            "Function to handle suspected cheaters added, default action kicks the player from the server.",
            "Logs for actions like addXp, addPoints, removePoints, levelUp, unlockSkill, etc., added.",
            "Security improvements implemented.",
            "Additional warnings added for improper devhub_lib connection.",
            "Sound files optimized from .wav/.mp3 to .ogg, reducing size from 1,487 KB to 135 KB.",
            "Visual handling of skill unlock failures improved.",
            "Fixed error on ESX for invalid command messages when opening via key mapping.",
            "Fixed earning XP while being in water but not swimming.",
            "Moved sounds folder to public directory to prevent filename changes after releases.",
            "Disabled confetti animation when skill unlocking fails.",
            " ",
            "WARNING: Client exports addXp and addPoints are now disabled by default. To re-enable, modify configs/s.main.lua and set Config.DisableSensitiveClientExports to false. Server exports are recommended for security."
        ]
    },
    "dh_miner": {
        "version": "1.0.4",
        "changelog": ["Added missing translations to the config."]
    },
    "devhub_herbalAlchemist": {
        "version": "1.0.1",
        "changelog": ["Fixed an issue where textures would break after crafting a potion."]
    },
    "devhub_skillSelection": {
        "version": "1.0.0",
        "changelog": ["Script released."]
    }
}
