{
    "dh_cartune": "1.0.0",
    "dh_cardance": "1.0.0",
    "dh_lib": "2.0.0",
    "devhub_lib": "2.0.0",
    "devhub_lib_new": {
        "version": "2.0.0",
        "changelog": [
            "Restructured folder system: core (for core functions), html (UI files), modules (frameworks, keys, targets, fuel, etc.).",
            "Sound playback moved to lib for easy integration with custom systems or xsound.",
            "Model request validation added—prints warning in F8 if the model does not exist.",
            "Auto-detection of vehicle key system implemented.",
            "Auto-detection of vehicle fuel system implemented.",
            "AddCoordsToTarget function added to target/c.custom.lua.",
            "UI customization options added—change UI placement and notification type without modifying core code.",
            "Player logs now use Steam names instead of in-game names.",
            "Improved validation for QBCore GetFullName.",
            "Added esx:onPlayerLogout event to ESX client.",
            "Key and fuel system connections now handled via config.lua, no need to edit core code.",
            "Improved devhub_lib documentation."
        ]
    },
    "dh_skillTree": {
        "version": "2.0.0",
        "changelog": [
            "Added ability to connect images in place of skill icons.",
            "Added tooltips added to the Skill Tree generator to clarify the purpose of each parameter.",
            "Added new option to hide category visibility for specific users: Config.CategoryVisibilityHandler.",
            "Added functionality to remove XP within the current level range without reducing the level.",
            "Added server-side exports: removePoints and removeXp.",
            "Added uI configuration to adjust sound volume and customize number formatting.",
            "Added text formatting for XP numbers in the UI.",
            "Added missing translations in the Skill Tree generator.",
            "Added client-side export: closeSkillTree.",
            "Added server-side export: getUnlockedSkills.",
            "Added client-side export: getConfig.",
            "Added new options in the generator for skill tree customization.",
            "Added system to block unlocking of certain skills if another skill is unlocked.",
            "Added additional animations in the UI, such as confetti upon unlocking a skill.",
            "Added highlight color changed to the primary theme color.",
            "Added summary of missed errors added during the save attempt in the generator.",
            "Fixed cached keybind issue for opening the menu via keybind.",
            "Fixed skill category selection centering in the top panel.",
            "Fixed incorrectly displayed warning about duplicate UID in the generator when replacing a previously assigned UID.",
            "Fixed issue where opening a new skill info window replaced information in an already open window.",
            "Resolved an issue that was causing the Herbal Skill Tree to fail loading occasionally",
            "Fixed sound not working in certain cases.",
            "Improved rendering performance of various Skill Tree UI components.",
            "Improved validation of already-used categories in the generator.",
            "Improved validation of used UIDs, points, and skill effects.",
            "Improved highlighting of skills with errors or missing required data in the generator.",
            "Renamed parameters in exports and listeners for better intuitiveness.",
            "Expanded README and documentation with numerous examples for using exports and listeners.",
            "Updated resource name, exports, and listeners to align with new scripts for consistency.",
            "",
            "[Old export and listener names will continue to work, so no changes are required in existing code. Script name changes in the CFG are also unnecessary.]",
            "[All files should be replaced except configs/sh.skills.lua and configs/sh.main.lua. The remaining config files can be easily compared, and only the additions should be transferred. The updates are marked as 'update 2.0.0'.]"
        ]
    },
    "devhub_skillTree": {
        "version": "2.1.3",
        "changelog": [
            "Security system now allows sending multiple XP exports even within less than a second between.",
            "Reduced size of bundled icons for better performance.",
            "Removed unlockRequirementMessage from being included in the generated config.",
            "Added class `unlockableBox` to boxes that can be unlocked, allowing customization of scale and other parameters via CSS."
        ]
    },
    "dh_miner": {
        "version": "1.0.5",
        "changelog": [
            "Fixed a bug where a player was not reverted to their original clothes after being removed from a group during work.",
            "Integrated the script with the new sound system from devhub_lib.",
            "Added Shared.SoundVolume to the config and volume to config.js.",
            "Added a notification when a player is accepted into a group.",
            "Renamed dh_miner to devhub_miner, no further action required.",
            "Requires devhub_lib update to version 2.0.0."
        ]
    },
    "devhub_miner": {
        "version": "1.0.5",
        "changelog": [
            "Fixed a bug where a player was not reverted to their original clothes after being removed from a group during work.",
            "Integrated the script with the new sound system from devhub_lib.",
            "Added Shared.SoundVolume to the config and volume to config.js.",
            "Added a notification when a player is accepted into a group.",
            "Renamed dh_miner to devhub_miner, no further action required.",
            "Requires devhub_lib update to version 2.0.0."
        ]
    },
    "devhub_herbalAlchemist": {
        "version": "1.0.2",
        "changelog": [
            "Added the option to enable job requirements.",
            "Integrated the script with the new sound system from devhub_lib.",
            "Added Shared.SoundVolume to the config and volume to config.js.",
            "Added a notification when a player is accepted into a group.",
            "Fixed a bug where a player was not reverted to their original clothes after being removed from a group during work.",
            "Requires devhub_lib update to version 2.0.0."
        ]
    },
    "devhub_skillSelection": {
        "version": "1.0.0",
        "changelog": ["Script released."]
    },
    "devhub_drywoodCutter": {
        "version": "1.0.0",
        "changelog": ["Script released."]
    }
}
